// 整个大陆地图分区
const MAP_AREA_CFG = [
  '大裂谷',
  '南部海域',
  '彷徨沼泽',
  '大荒漠',
  '风哭岩脉',
  '大雪山',
  '天擎山',
  '云罗谷地',
  '中州大陆'
]

// 每个具体刷怪地图
const MAP_ENEMY_AREA = [
  // 清泉市中心
  '市中心母巢',
  '母巢甬道',
  '黏菌孵化室',
  '清泉市警局',
  // 清泉市北郊
  '灵湖湿地公园',
  '76号街',
  '蜂巢无人机生产基地',
  '数控种植塔',
  '温室遗址', // 魔鬼蛾巢穴
  '市郊第三医院',
  '贝特街', // 幸存者聚居地
  '布朗农庄', // 幸存者聚居地
  '公路镇', // 幸存者聚居地
  '绿柳营地', // 幸存者聚居地
  '地铁7号线',
  '废弃轮胎厂', // 血手氏族
  '渔牧区', // 旧时代渔牧业地区
  '中州航天研究中心', // 应该有些储能（燃料棒），或者科技（蓝图）可以回收，等级较高，内有死亡之爪
  // 巨石城
  '贫民窟',
  '地下甬道',
  '北部五环沿线',
  '黑月酒吧',
  '巨石军工',
  // 红河镇
  '矿场',
  '垃圾山',
  '奴隶市场',
  // 大裂谷
  '盘石地质公园', // 盘古储能中心外围
  '盘古储能中心', // 盘石地质公园中心，剩余核能电解海水，大量固态氢能源储量，庞大工业园区
]