// 敌人名称
const ENEMY_NAME = [
  // Goblin
  '哥布林', '哥布林流氓', '哥布林法师', '哥布林弓箭手',
  // Mutants
  '变种人', '变种巨人', '瘟疫先知', '瘟疫冠军', '瘟疫僧', '蝠翼人', '魔鬼蛾', '烈爪蟹', '变异老鼠', '变异蟑螂', '变异麋鹿', '变异水蛭', '死亡沙虫', '人面沙蝎',
  // Slime mold
  '黏菌', '变异黏菌', '泰坦黏菌', '爆裂黏菌', '爬行者', '啃食者', '黏菌母体', '黏菌母巢',
  // Wolf
  '狼', '黑狼', '冬狼',
  // Slime
  '史莱姆', '天使史莱姆', '骑士史莱姆', '十字军史莱姆',
  // Orc
  '兽人剑师', '兽人刀斧手', '兽人弓箭手', '兽人法师',
  // Spider
  '蜘蛛', '红蜘蛛', '绿蜘蛛',
  // Skeleton
  '骷髅弓箭手', '骷髅剑师', '骷髅骑士', '骷髅法师', '骷髅海盗', '骷髅武士', '骷髅战士',
  // Bosses
  '萨尔特，哥布林的主宰者', '女妖，骷髅王', '熔岩蜘蛛', '三头犬·托勒密奥斯', '地狱恶犬', '贝特洛，不死之王', '史莱姆之王', '癌症星座', '阿尔法德里尔，光之泰坦', '提亚马特，龙骑士', '无名堕落之王', '白羊座', '利拉德，蚁后', '发条蜘蛛', '阿拉贡，致命之狼', '腐蚀之王',
  // Monarch 君主
  '奈齐尔，蜘蛛龙', '死亡领主乌里奥特', '幻灵之力', '湿婆', '巨兽', '血术野性', '桑纳托斯死神', '黑暗天使收割者', '扎拉拉斯，龙王'
];

// 通过类型过滤敌人名称
const ENEMY_NAMES_FILTER_BY_TYPE = {
  // 进攻型
  Offensive: {
    // 守护者
    guardian: [
      '萨尔特，哥布林的主宰者', '女妖，骷髅王', '熔岩蜘蛛', '贝特洛，不死之王'
    ],
    // boss
    sboss: [
      '巨兽', '扎拉拉斯，龙王'
    ],
    // 其他
    other: [
      '哥布林法师', '哥布林弓箭手',
      '狼', '黑狼', '冬狼',
      '骑士史莱姆',
      '兽人剑师', '兽人刀斧手', '兽人弓箭手', '兽人法师',
      '红蜘蛛',
      '骷髅弓箭手', '骷髅剑师', '骷髅法师', '骷髅海盗', '骷髅武士',
    ]
  },
  // 防御型
  Defensive: {
    // 守护者
    guardian: [
      '史莱姆之王', '癌症星座', '阿尔法德里尔，光之泰坦'
    ],
    // boss
    sboss: [
      '死亡领主乌里奥特',
    ],
    // 其他
    other: [
      '天使史莱姆', '骑士史莱姆', '十字军史莱姆',
      '绿蜘蛛',
      '骷髅骑士', '骷髅战士'
    ]
  },
  // 均衡型
  Balanced: {
    // 守护者
    guardian: [
      '提亚马特，龙骑士', '无名堕落之王', '白羊座'
    ],
    // boss
    sboss: [
      '幻灵之力', '湿婆', '桑纳托斯死神'
    ],
    // 其他
    other: [
      '哥布林',
      '史莱姆', '天使史莱姆', '骑士史莱姆',
      '兽人剑师', '兽人刀斧手', '兽人弓箭手', '兽人法师',
      '蜘蛛',
      '骷髅骑士', '骷髅战士'
    ]
  },
  // 迅捷型
  Quick: {
    // 守护者
    guardian: [
      '利拉德，蚁后', '发条蜘蛛'
    ],
    // boss
    sboss: [
      '黑暗天使收割者', '奈齐尔，蜘蛛龙'
    ],
    // 其他
    other: [
      '哥布林', '哥布林流氓', '哥布林弓箭手',
      '狼', '黑狼', '冬狼',
      '兽人剑师',
      '蜘蛛', '红蜘蛛', '绿蜘蛛',
      '骷髅剑师', '骷髅海盗', '骷髅武士'
    ]
  },
  // 致命型
  Lethal: {
    // 守护者
    guardian: [
      '阿拉贡，致命之狼', '三头犬·托勒密奥斯', '地狱恶犬'
    ],
    // boss
    sboss: [
      '血术野性'
    ],
    // 其他
    other: [
      '哥布林流氓',
      '狼', '黑狼', '冬狼',
      '兽人剑师', '兽人刀斧手',
      '红蜘蛛',
      '骷髅剑师', '骷髅武士'
    ]
  },
}
export {
  ENEMY_NAME,
  ENEMY_NAMES_FILTER_BY_TYPE
}